In [1]:
#Dependencies
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func

In [2]:
#Store filepath in a variable
projections = 'Texas2018-2028Projections.csv'
entry_salary = 'TexasAnnualSalaryEntry.csv'
experience_salary = 'TexasAnnualSalaryExperience.csv'
mean_salary = 'TexasAnnualSalaryMean.csv'
median_salary = 'TexasAnnualSalaryMedian.csv'

In [3]:
#Read data file with pandas
projections_df = pd.read_csv(projections)
entry_salary_df = pd.read_csv(entry_salary)
experience_salary_df = pd.read_csv(experience_salary)
mean_salary_df = pd.read_csv(mean_salary)
median_salary_df = pd.read_csv(median_salary)

In [4]:
#Create identifying columns in each dataframe before append to allow identification/filtering of data type post-append
entry_salary_df['salary_category']= 'entry'
experience_salary_df['salary_category'] = 'experienced'
mean_salary_df['salary_category'] = 'mean'
median_salary_df['salary_category'] = 'median'

In [35]:
#Append four tables on top of eachother
append_salary = pd.concat([entry_salary_df,experience_salary_df,mean_salary_df,median_salary_df], axis=0)

In [33]:
#Count columns to confirm successful append operation
append_salary.count()

SOC                                3192
SOC Title                          3192
Statewide                          3192
Abilene                            3192
Amarillo                           3192
Austin-Round Rock                  3192
Beaumont-Port Arthur               3192
Brownsville-Harlingen              3192
College Station-Bryan              3192
Corpus Christi                     3192
Dallas-Fort Worth-Arlington        3192
El Paso                            3192
Houston-The Woodlands-Sugarland    3192
Killeen-Temple                     3192
Laredo                             3192
Longview                           3192
Lubbock                            3192
McAllen-Edinburg-Mission           3192
Midland                            3192
Odessa                             3192
San Angelo                         3192
San Antonio-New Braunfels          3192
Sherman-Denison                    3192
Texarkana                          3192
Tyler                              3192
Victoria                           3192
waco                               3192
Wichita Falls                      3192
salary_category                    3192
job_code                           3192
dtype: int64

In [7]:
#Create dataframe with newly appended data
append_salary_df = pd.DataFrame(append_salary)

#View Data
append_salary_df.head()

,SOC,SOC Title,Statewide,Abilene,Amarillo,Austin-Round Rock,Beaumont-Port Arthur,Brownsville-Harlingen,College Station-Bryan,Corpus Christi,...,Odessa,San Angelo,San Antonio-New Braunfels,Sherman-Denison,Texarkana,Tyler,Victoria,waco,Wichita Falls,salary_category
0,"""00-0000""","Total, All Occupations",22887,21201,22043,25379,21972,19168,21696,21487,...,25032,20657,23118,21531,21136,21447,21285,22057,20393,entry
1,"""11-0000""",Management Occupations,57365,44052,50349,58977,52318,36117,51876,46898,...,53912,44446,59448,51127,42942,41144,47127,49591,41744,entry
2,"""11-1011""",Chief Executives,134756,110009,90448,127876,0,106301,143182,127491,...,148896,122978,133347,128121,60765,107130,85343,90802,118037,entry
3,"""11-1021""",General and Operations Managers,49353,37330,46792,48282,46440,29135,38408,39930,...,51301,39654,58107,44553,39117,30077,46951,41230,34285,entry
4,"""11-1031""",Legislators,17524,17154,30938,20794,17763,0,17290,17287,...,0,25503,31541,17734,20360,0,17668,0,30953,entry

In [8]:
#Remove quotes surrounding 'SOC' code
append_salary_df['job_code'] = append_salary_df['SOC'].str.replace(r'"','')

#Remove additional spaces surrounding 'job_code'
append_salary_df['job_code'] = append_salary_df['job_code'].str.strip()

#Rename Columns
new_salary = append_salary_df.rename(columns={"SOC Title": "title",
                                              "Statewide": "statewide",
                                              "Abilene": "abilene",
                                              "Amarillo": "amarillo",
                                              "Austin-Round Rock": "austin",
                                              "Beaumont-Port Arthur": "beaumont",
                                              "Brownsville-Harlingen": "brownsville",
                                              "College Station-Bryan": "college-station",
                                              "Corpus Christi": "corpus_christi",
                                              "Dallas-Fort Worth-Arlington": "dallas",
                                              "El Paso": "el_paso",
                                              "Houston-The Woodlands-Sugarland": "houston",
                                              "Killeen-Temple": "killeen",
                                              "Laredo": "laredo",
                                              "Longview": "longview",
                                              "Lubbock": "lubbock",
                                              "McAllen-Edinburg-Mission": "mcallen",
                                              "Midland": "midland",
                                              "Odessa": "odessa",
                                              "San Angelo": "san_angelo",
                                              "San Antonio-New Braunfels": "san_antonio",
                                              "Sherman-Denison": "sherman",
                                              "Texarkana": "texarkana",
                                              "Tyler": "tyler",
                                              "Victoria": "victoria",
                                              "waco": "waco",
                                              "Wichita Falls": "wichita_falls"})

In [9]:
#Drop 'SOC' column from dataframe
clean_salary = new_salary.drop(columns='SOC')

#Confirm column removed
clean_salary.head()

,title,statewide,abilene,amarillo,austin,beaumont,brownsville,college-station,corpus_christi,dallas,...,san_angelo,san_antonio,sherman,texarkana,tyler,victoria,waco,wichita_falls,salary_category,job_code
0,"Total, All Occupations",22887,21201,22043,25379,21972,19168,21696,21487,23958,...,20657,23118,21531,21136,21447,21285,22057,20393,entry,00-0000
1,Management Occupations,57365,44052,50349,58977,52318,36117,51876,46898,62795,...,44446,59448,51127,42942,41144,47127,49591,41744,entry,11-0000
2,Chief Executives,134756,110009,90448,127876,0,106301,143182,127491,157696,...,122978,133347,128121,60765,107130,85343,90802,118037,entry,11-1011
3,General and Operations Managers,49353,37330,46792,48282,46440,29135,38408,39930,54750,...,39654,58107,44553,39117,30077,46951,41230,34285,entry,11-1021
4,Legislators,17524,17154,30938,20794,17763,0,17290,17287,17612,...,25503,31541,17734,20360,0,17668,0,30953,entry,11-1031

# Final 'title' Table

In [36]:
#Create a table with only title and job code 'job_title' table
title_df = clean_salary[['title','job_code']]

#Remove duplicate data from title table ensuring unique data
unique_title = title_df.drop_duplicates()

#Remove spaces surrounding 'job_code'
unique_title['job_code'] = unique_title['job_code'].str.strip()

#View data/confirm no duplicates
unique_title

<ipython-input-36-88b638e06abb>:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  unique_title['job_code'] = unique_title['job_code'].str.strip()

                                         title job_code
0                       Total, All Occupations  00-0000
1                       Management Occupations  11-0000
2                             Chief Executives  11-1011
3              General and Operations Managers  11-1021
4                                  Legislators  11-1031
..                                         ...      ...
793    Pump Operators, Except Wellhead Pumpers  53-7072
794                           Wellhead Pumpers  53-7073
795  Refuse and Recyclable Material Collectors  53-7081
796          Tank Car, Truck, and Ship Loaders  53-7121
797         Material Moving Workers, All Other  53-7199

[798 rows x 2 columns]

# FINAL SALARY TABLE

In [11]:
#Remove 'title' column
columns_salary = clean_salary.drop(columns='title')

#Remove spaces surrounding 'job code'
columns_salary['job_code'] = columns_salary['job_code'].str.strip()

#View Data
columns_salary.head()

,statewide,abilene,amarillo,austin,beaumont,brownsville,college-station,corpus_christi,dallas,el_paso,...,san_angelo,san_antonio,sherman,texarkana,tyler,victoria,waco,wichita_falls,salary_category,job_code
0,22887,21201,22043,25379,21972,19168,21696,21487,23958,19259,...,20657,23118,21531,21136,21447,21285,22057,20393,entry,00-0000
1,57365,44052,50349,58977,52318,36117,51876,46898,62795,49097,...,44446,59448,51127,42942,41144,47127,49591,41744,entry,11-0000
2,134756,110009,90448,127876,0,106301,143182,127491,157696,129303,...,122978,133347,128121,60765,107130,85343,90802,118037,entry,11-1011
3,49353,37330,46792,48282,46440,29135,38408,39930,54750,43830,...,39654,58107,44553,39117,30077,46951,41230,34285,entry,11-1021
4,17524,17154,30938,20794,17763,0,17290,17287,17612,17799,...,25503,31541,17734,20360,0,17668,0,30953,entry,11-1031

In [12]:
#Review 'projections' data
projections_df.head()

,SOC,SOC Title,Employment,Projected,Absolute Change,Percent Change,Average Annual Openings
0,"""00-0000""","Total, All Occupations",13451119,15152870,1701751,12.6514,1812852
1,"""11-1011""",Chief Executives,7217,7437,220,3.0484,543
2,"""11-1021""",General and Operations Managers,201052,235280,34228,17.0245,22369
3,"""11-1031""",Legislators,1801,1960,159,8.8284,159
4,"""11-2011""",Advertising and Promotions Managers,1712,1964,252,14.7196,198

In [13]:
#Remove quotes surrounding 'job_code'
projections_df['job_code'] = projections_df['SOC'].str.replace(r'"','')

#View Data
projections_df.head()

,SOC,SOC Title,Employment,Projected,Absolute Change,Percent Change,Average Annual Openings,job_code
0,"""00-0000""","Total, All Occupations",13451119,15152870,1701751,12.6514,1812852,00-0000
1,"""11-1011""",Chief Executives,7217,7437,220,3.0484,543,11-1011
2,"""11-1021""",General and Operations Managers,201052,235280,34228,17.0245,22369,11-1021
3,"""11-1031""",Legislators,1801,1960,159,8.8284,159,11-1031
4,"""11-2011""",Advertising and Promotions Managers,1712,1964,252,14.7196,198,11-2011

In [14]:
#Remove 'SOC' Column
clean_projections = projections_df.drop(columns='SOC')

#Review cleaned data
clean_projections.head()

,SOC Title,Employment,Projected,Absolute Change,Percent Change,Average Annual Openings,job_code
0,"Total, All Occupations",13451119,15152870,1701751,12.6514,1812852,00-0000
1,Chief Executives,7217,7437,220,3.0484,543,11-1011
2,General and Operations Managers,201052,235280,34228,17.0245,22369,11-1021
3,Legislators,1801,1960,159,8.8284,159,11-1031
4,Advertising and Promotions Managers,1712,1964,252,14.7196,198,11-2011

In [15]:
#Rename columns for projection table
new_projections = clean_projections.rename(columns={"SOC Title": "title",
                                                    "Employment": "employment",
                                                    "Projected": "projections",
                                                    "Absolute Change": "absolute_change",
                                                    "Percent Change": "percent_change",
                                                    "Average Annual Openings": "avg_annual_openings"})

In [16]:
#Review column name changes
new_projections.head()

,title,employment,projections,absolute_change,percent_change,avg_annual_openings,job_code
0,"Total, All Occupations",13451119,15152870,1701751,12.6514,1812852,00-0000
1,Chief Executives,7217,7437,220,3.0484,543,11-1011
2,General and Operations Managers,201052,235280,34228,17.0245,22369,11-1021
3,Legislators,1801,1960,159,8.8284,159,11-1031
4,Advertising and Promotions Managers,1712,1964,252,14.7196,198,11-2011

# Final 'projections' Table

In [17]:
#Drop 'title' column
column_projections = new_projections.drop(columns = 'title')

#Remove empty spaces from 'job_code'
column_projections['job_code'] = column_projections['job_code'].str.strip()

#View dataframe
column_projections.head()

,employment,projections,absolute_change,percent_change,avg_annual_openings,job_code
0,13451119,15152870,1701751,12.6514,1812852,00-0000
1,7217,7437,220,3.0484,543,11-1011
2,201052,235280,34228,17.0245,22369,11-1021
3,1801,1960,159,8.8284,159,11-1031
4,1712,1964,252,14.7196,198,11-2011

# Web Scraping

In [18]:
#Define the url
url = 'https://www.bls.gov/emp/tables/education-and-training-by-occupation.htm'

In [19]:
#Webscraping
tables = pd.read_html(url)
tables

[                 2020 National Employment Matrix title  \
 0                                     Chief executives
 1                      General and operations managers
 2                                          Legislators
 3                  Advertising and promotions managers
 4                                   Marketing managers
 ..                                                 ...
 786                                   Wellhead pumpers
 787          Refuse and recyclable material collectors
 788                  Tank car, truck, and ship loaders
 789                 Material moving workers, all other
 790  Source: Employment Projections program, U.S. B...

                   2020 National Employment Matrix code  \
 0                                              11-1011
 1                                              11-1021
 2                                              11-1031
 3                                              11-2011
 4                                              11-2021
 ..                                                 ...
 786                                            53-7073
 787                                            53-7081
 788                                            53-7121
 789                                            53-7199
 790  Source: Employment Projections program, U.S. B...

                     Typical education needed for entry  \
 0                                    Bachelor's degree
 1                                    Bachelor's degree
 2                                    Bachelor's degree
 3                                    Bachelor's degree
 4                                    Bachelor's degree
 ..                                                 ...
 786                  High school diploma or equivalent
 787                   No formal educational credential
 788                   No formal educational credential
 789                   No formal educational credential
 790  Source: Employment Projections program, U.S. B...

                Work experience in a related occupation  \
 0                                      5 years or more
 1                                      5 years or more
 2                                    Less than 5 years
 3                                    Less than 5 years
 4                                      5 years or more
 ..                                                 ...
 786                                  Less than 5 years
 787                                               None
 788                                               None
 789                                               None
 790  Source: Employment Projections program, U.S. B...

     Typical on-the-job training needed to attain competency in the occupation
 0                                                 None
 1                                                 None
 2                                                 None
 3                                                 None
 4                                                 None
 ..                                                 ...
 786                  Moderate-term on-the-job training
 787                     Short-term on-the-job training
 788                     Short-term on-the-job training
 789                     Short-term on-the-job training
 790  Source: Employment Projections program, U.S. B...

 [791 rows x 5 columns]]

In [20]:
#checking the datatype
type(tables)

list

In [21]:
#Creating a dataframe from website data
education_df = tables[0]
education_df.head()

,2020 National Employment Matrix title,2020 National Employment Matrix code,Typical education needed for entry,Work experience in a related occupation,Typical on-the-job training needed to attain competency in the occupation
0,Chief executives,11-1011,Bachelor's degree,5 years or more,None
1,General and operations managers,11-1021,Bachelor's degree,5 years or more,None
2,Legislators,11-1031,Bachelor's degree,Less than 5 years,None
3,Advertising and promotions managers,11-2011,Bachelor's degree,Less than 5 years,None
4,Marketing managers,11-2021,Bachelor's degree,5 years or more,None

In [22]:
#Refining the headers
education_df = education_df.rename(columns= {"2020 National Employment Matrix title":"job_title", "2020 National Employment Matrix code":"job_code", "Typical education needed for entry":"education", "Work experience in a related occupation":"work_experience","Typical on-the-job training needed to attain competency in the occupation":"training"})
education_df.head()

,job_title,job_code,education,work_experience,training
0,Chief executives,11-1011,Bachelor's degree,5 years or more,None
1,General and operations managers,11-1021,Bachelor's degree,5 years or more,None
2,Legislators,11-1031,Bachelor's degree,Less than 5 years,None
3,Advertising and promotions managers,11-2011,Bachelor's degree,Less than 5 years,None
4,Marketing managers,11-2021,Bachelor's degree,5 years or more,None

In [23]:
#Dropping a column
clean_education_df = education_df.drop(columns="job_title")
clean_education_df.head()

  job_code          education    work_experience training
0  11-1011  Bachelor's degree    5 years or more     None
1  11-1021  Bachelor's degree    5 years or more     None
2  11-1031  Bachelor's degree  Less than 5 years     None
3  11-2011  Bachelor's degree  Less than 5 years     None
4  11-2021  Bachelor's degree    5 years or more     None

In [24]:
#Import username and password from .config file
from config import user,pwd

#Connect to postgresql
engine = create_engine(f'postgresql://{user}:{pwd}@localhost:5432/employee_db')
connection = engine.connect()

In [25]:
#Store the dataframe as html file
clean_education_df.to_html('education_table.html')

#Create 4 tables in Postgresql
unique_title.to_sql('job_title', engine, if_exists = 'replace', index=False)
clean_education_df.to_sql('education', engine, if_exists = 'replace', index=False)
column_projections.to_sql('projections', engine, if_exists = 'replace', index=False)
columns_salary.to_sql('salary', engine, if_exists = 'replace', index=False)

# Data Analysis

In [26]:
#Data analysis
#Remove duplicates from 'job_code'
jobs = clean_education_df["job_code"].nunique()

#Print number of jobs
print("The total number of jobs listed in the Employment projection program are:",jobs)

The total number of jobs listed in the Employment projection program are: 791

In [27]:
#Counting values in 'training' column
training = clean_education_df["training"].value_counts()

#Print information about data
print("Number of jobs with training requirements:")

#Create dataframe
training_df = pd.DataFrame(training)

#Reset dataframe index
training_df= training_df.reset_index()

#Rename columns
training_df = training_df.rename(columns={"training":"number of jobs", "index":"training required"})

#Create calculated column
training_df["percentage of jobs"] = training_df["number of jobs"]/jobs*100

#Change format of column
training_df["percentage of jobs"] = training_df["percentage of jobs"].astype(float).map("{:,.0f}%".format)

#View dataframe
training_df.head()

Number of jobs with training requirements:

                   training required  number of jobs percentage of jobs
0                               None             306                39%
1  Moderate-term on-the-job training             222                28%
2     Short-term on-the-job training             166                21%
3      Long-term on-the-job training              56                 7%
4               Internship/residency              25                 3%

In [28]:
#Counting values in 'work experience' column
experience = clean_education_df["work_experience"].value_counts()

#Print information about data
print("Number of jobs with experience requirements:")

#Create dataframe
experience_df = pd.DataFrame(experience)

#Reset dataframe index
experience_df = experience_df.reset_index()

#Remove index 3 row
experience_df = experience_df.drop(index=3)

#Rename columns
experience_df = experience_df.rename(columns={"work_experience":"number of jobs", "index":"experience required"})

#Create calculation column
experience_df["percentage of jobs"] = experience_df["number of jobs"]/jobs*100

#Change format of column
experience_df["percentage of jobs"] = experience_df["percentage of jobs"].astype(float).map("{:,.0f}%".format)

#View dataframe
experience_df.head()

Number of jobs with experience requirements:

  experience required  number of jobs percentage of jobs
0                None             686                87%
1   Less than 5 years              77                10%
2     5 years or more              27                 3%

In [29]:
#Counting values in 'education' column
degree = clean_education_df["education"].value_counts()

#Print information about data
print("Number of jobs with education requirements:")

#Create dataframe
degree_df = pd.DataFrame(degree)

#Reset dataframe index
degree_df = degree_df.reset_index()

#Rename columns
degree_df = degree_df.rename(columns={"education":"number of jobs", "index":"degree required"})

#Create calculated column
degree_df["percentage of jobs"] = degree_df["number of jobs"]/jobs*100

#Change column format
degree_df["percentage of jobs"] = degree_df["percentage of jobs"].astype(float).map("{:,.0f}%".format)

#View dataframe
degree_df.head()

Number of jobs with education requirements:

                     degree required  number of jobs percentage of jobs
0  High school diploma or equivalent             322                41%
1                  Bachelor's degree             169                21%
2   No formal educational credential             103                13%
3    Doctoral or professional degree              64                 8%
4      Postsecondary nondegree award              45                 6%